Revit 2024 API
ExtrusionRoof.CurtainGrids Property
Retrieve all the CurtainGrid objects of a curtain Roof.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public CurtainGridSet CurtainGrids { get; }
Visual Basic
Public ReadOnly Property CurtainGrids As CurtainGridSet
	Get
Visual C++
public:
property CurtainGridSet^ CurtainGrids {
	CurtainGridSet^ get ();
}
Remarks
Only when the object is a CurtainRoof, this property makes sense.
See Also
ExtrusionRoof Class
Autodesk.Revit.DB Namespace